tap "github/bootstrap"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Codec library for encoding and decoding AV1 video streams
brew "aom"

# Official Amazon AWS command-line interface
brew "awscli"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Programmable completion for Bash 3.2
brew "bash-completion"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# GNU File, Shell, and Text utilities
brew "coreutils"

# GitHub command-line tool
brew "gh"

# Distributed revision control system
brew "git"

# GNU Transport Layer Security (TLS) Library
brew "gnutls"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"

# GNU grep, egrep and fgrep
brew "grep"

# GitHub Markdown previewer
brew "grip"

# Manage compile and link flags for libraries
brew "pkg-config"

# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"

# Tools and libraries to manipulate images in many formats
brew "imagemagick"

# Portable Foreign Function Interface library
brew "libffi"

# Text-based web browser
brew "lynx"

# Keep your Mac's application settings in sync
brew "mackup"

# Mac App Store command-line interface
brew "mas"

# Open source relational database management system
brew "mysql", restart_service: true

# Development kit for the Java programming language
brew "openjdk"

# Development kit for the Java programming language
brew "openjdk@11"

# Swiss-army knife of markup format conversion
brew "pandoc"

# Pinentry for GPG on Mac
brew "pinentry-mac"

# Object-relational database system
brew "postgresql", restart_service: true

# Implementation of Telnet and SSH
brew "putty"

# Interpreted, interactive, object-oriented programming language
brew "python@3.10"

# Install various Ruby versions and implementations
brew "ruby-build"

# Ruby version manager
brew "rbenv"

# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"

# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true

# Terminal multiplexer with VT100/ANSI terminal emulation
# brew "screen" # prefer tmux

# Version control system designed to be a better CVS
brew "subversion"

# User interface to the TELNET protocol
brew "telnet"

# Send macOS User Notifications from the command-line
brew "terminal-notifier"

# Terminal multiplexer
brew "tmux"

# Internet file retriever
brew "wget"

# UNIX shell (command interpreter)
brew "zsh"

# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"

# Additional completion definitions for zsh
brew "zsh-completions"

# Informative git prompt for zsh
brew "zsh-git-prompt"

# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"

# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# Password manager that keeps all passwords secure behind one password
cask "1password"

# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"

# Application launcher and productivity software
cask "alfred"

# Compare files and folders
cask "beyond-compare"

# OpenAI's official ChatGPT desktop app
cask "chatgpt"

# Automated testing of webapps for Google Chrome
cask "chromedriver"

# Anti-virus and malware scanner
cask "clamxav"

# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"

# Server and cloud storage browser
cask "cyberduck"

# Browser for SQLite databases
cask "db-browser-for-sqlite"

# Presentations from Markdown
cask "deckset"

# Voice and text chat software
cask "discord"

# Application window manager focusing on simplicity
cask "divvy"

# App to build and share containerised applications and microservices
cask "docker"

# Online diagram software
cask "drawio"

# Client for the Dropbox cloud storage service
cask "dropbox"

# Sync DriveThruRPG libraries to compatible devices
cask "drivethrurpg"

# Collaborative team software
cask "figma"

# Web browser
cask "firefox"

# Tool to turn any web page into a desktop app
cask "flotato"

# Monospaced font
cask "font-monaspace"

# Source Code Pro font
cask "font-source-code-pro"

# Source Code Pro for Powerline font
cask "font-source-code-pro-for-powerline"

# Source Sans 3 font
cask "font-source-sans-3"

# Source Serif 4 font
cask "font-source-serif-4"

# Amazon Glacier file transfer client
cask "freeze"

# Update maps and software, sync with Garmin Connect and register your device
cask "garmin-express"

# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"

# Client for the Google Drive storage service
cask "google-drive"

# Tools to protect your emails and files
cask "gpg-suite"

# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"

# Tool to optimise images to a smaller size
cask "imageoptim"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"

# Enhances Gmail like a full-featured desktop office productivity app
cask "kiwi-for-gmail"

# Software for Logitech devices
cask "logi-options-plus"

# Open-source Markdown editor
cask "macdown"

# Gmail client
cask "mailplane"

# Tool to control external monitor brightness & volume
cask "monitorcontrol"

# Tool to create text-based art
cask "monodraw"

# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"

# Configuration and firmware update utility for OBSBOT Tiny and Meet series
cask "obsbot-center"

# Web browser
cask "opera"

# Multi-version Postgres.app
# cask "postgres" # No longer hosted on homebrew; download from https://postgresapp.com/

# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"

# Quick Look generator for Markdown files
cask "qlmarkdown"

# Quick Look plugin for plaintext files without an extension
cask "qlstephen"

# Quick Look plugin for CSV files
cask "quicklook-csv"

# Quick Look plugin for JSON files
cask "quicklook-json"

# Control your tools with a few keystrokes
cask "raycast"

# Integrated development environment focused entirely on AppleScript
cask "script-debugger"

# MySQL/MariaDB database management platform
cask "sequel-pro"

# Video, audio and image converter
cask "shutter-encoder"

# Team communication and collaboration software
cask "slack"

# Music streaming service
cask "spotify"

# Workspace to manage all your productivity apps from one place
# cask "stack-stack" # Prefer v4 beta version from https://stackbrowser.com/

# Video game digital distribution service
cask "steam"

# File transfer application
cask "transmit"

# OpenVPN client with AppleScript support
cask "viscosity"

# Open-source code editor
cask "visual-studio-code"

# Notes organiser
cask "voodoopad"

# Rust-based terminal
cask "warp"

# Web browser
cask "wavebox"

# Application for configuring any YubiKey
cask "yubico-yubikey-manager"

# Video communication and virtual meeting platform
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "AnySwitch", id: 6444313776
mas "Bear", id: 1091189122
mas "Encrypto", id: 935235287
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Photomator", id: 1444636541
mas "QuikFlow", id: 1626354390
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
# mas "Window Focus", id: 1142625137 # License purchased directly from developer. Download from https://fiplab.com/
mas "Xcode", id: 497799835
