# Personal bundle
# Tooling specific to my personal workstations

# Set arguments for installing casks
# https://github.com/homebrew/homebrew-cask/blob/master/USAGE.md#options
# Tip: Use `force: true` to override `require_sha: true` on individual casks
cask_args require_sha: true, no_quarantine: true

## Formulae
brew "railway"            # Develop and deploy code with zero configuration
# brew "rbenv-default-gems" # Auto-installs gems for Ruby installs ! Prefer `mise`
# brew "rbenv"              # Ruby version manager ! Prefer `mise`

## Services ! Prefer devcontainers
# brew "mysql", restart_service: true      # Open source relational database management system
# brew "postgresql", restart_service: true # Object-relational database system
# brew "redis", restart_service: true      # Persistent key-value database, with built-in net interface

## Casks
cask "beyond-compare"         # Compare files and folders
cask "chatgpt"                # OpenAI's official ChatGPT desktop app
cask "clamxav"                # Anti-virus and malware scanner
cask "cleanmymac"             # Tool to remove unnecessary files and folders from disk
cask "cursor"                 # Write, edit, and chat about your code with AI
cask "cyberduck"              # Server and cloud storage browser
cask "discord"                # Voice and text chat software
cask "drawio"                 # Online diagram software
cask "drivethrurpg"           # Sync DriveThruRPG libraries to compatible devices
# cask "firefox"                # Web browser
# cask "flotato"                # Tool to turn any web page into a desktop app
# cask "fluid"                  # Tool to turn a website into a desktop app
cask "focusrite-control"      # Focusrite interface controller
cask "garmin-express"         # Update maps and software, sync with Garmin Connect and register your device
cask "gemini"                 # Disk space cleaner that finds and deletes duplicated and similar files
cask "google-drive"           # Client for the Google Drive storage service
cask "graphiql"               # Light, Electron-based Wrapper around GraphiQL
cask "imageoptim"             # Tool to optimise images to a smaller size
cask "lm-studio"              # Discover, download, and run local LLMs
# cask "mailplane"              # Gmail client ! Deprecated client
# cask "microsoft-edge"         # Multi-platform web browser
# cask "monofocus"              # Keep all tasks from your todo apps on your menu bar
cask "network-radar"          # Tool to scan and monitor the network
# cask "raycast"                # Control your tools with a few keystrokes
# cask "screenfocus"            # Tool to manage multiple screens
cask "script-debugger"        # Integrated development environment focused entirely on AppleScript
cask "scriptql"               # AppleScript Quick Look plugin
cask "shutter-encoder"        # Video, audio and image converter
cask "spotify"                # Music streaming service
cask "steam"                  # Video game digital distribution service
cask "the-unarchiver"         # Unpacks archive files
cask "transmit"               # File transfer application
cask "versions"               # Subversion client
# cask "viscosity"              # OpenVPN client with AppleScript support
cask "voodoopad"              # Notes organiser
cask "warp"                   # Rust-based terminal
# cask "wavebox"                # Web browser
# cask "yubico-yubikey-manager" # Application for configuring any YubiKey

## Apps from the Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Encrypto", id: 935_235_287
mas "Microsoft Excel", id: 462_058_435
mas "Microsoft Word", id: 586_447_913
mas "Photomator", id: 1_444_636_541
mas "Pixelmator Pro", id: 1289583905
mas "QuikFlow", id: 1_626_354_390
mas "Speedtest", id: 1_153_157_709
mas "TestFlight", id: 899247664
mas "Video Editor Movavi", id: 1_388_868_440

## VS code extensions
vscode "GitHub.copilot-chat"                        # AI chat features powered by Copilot
vscode "GitHub.copilot"                             # Your AI pair programmer

## VS Code Extension Packs
#
# Brew bundle doesn't do a good job of managing extension packs. Currently you
# must specify the extension pack name and the individual extensions, otherwise
# `brew bundle install --cleanup` will remove any extensions in the pack that
# are not explicitly listed in the Brewfile.

### Jupyter Notebooks
vscode "ms-toolsai.jupyter-keymap"                  # Jupyter keymaps for notebooks
vscode "ms-toolsai.jupyter-renderers"               # Renderers for Jupyter Notebooks (with plotly, vega, gif, png, svg, jpeg and other such outputs)
vscode "ms-toolsai.jupyter"                         # Jupyter notebook support, interactive programming and computing that supports Intellisense, debugging and more.
vscode "ms-toolsai.vscode-jupyter-cell-tags"        # Jupyter Cell Tags support for VS Code
vscode "ms-toolsai.vscode-jupyter-slideshow"        # Jupyter Slide Show support for VS Code
